Revit 2024 API
BuiltInFailures.SplitSketchBasedElementFailures Class
 Failures related to the split sketched based element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SplitSketchBasedElementFailures
Visual Basic
Public NotInheritable Class SplitSketchBasedElementFailures
Visual C++
public ref class SplitSketchBasedElementFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SplitSketchBasedElementFailures
See Also
BuiltInFailures.SplitSketchBasedElementFailures Members
Autodesk.Revit.DB Namespace